src/InformationRegisters/СостоянияПросмотраОписаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПросмотраОписаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Просмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СообщенияВТехническуюПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СообщенияВТехническуюПоддержку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСообщенийВТехническуюПоддержку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанноеСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Файлы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объекты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Новое, Отклонено при согласовании, Отправлено, Отклонено разработчиком, Принято, Выполнено</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСообщенийВТехническуюПоддержку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазработчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРазработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРазработчика</Name>
					<Comment>Получено, Отклонено, В работе, Установлено в программу, Оказана консультация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаРазработку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскийПриоритетСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектныйПриоритетСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоКогда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияПросмотраОписаний/Ext/ManagerModule.bsl
// 21.10.2015, Белопухов А.Н., п.3388, НАЧАЛО
&НаСервере
Функция ВОбновленииЕстьПунктыПользователя(Пользователь, ВерсияКонфигунации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщенияВТехническуюПоддержку.Идентификатор
	|ИЗ
	|	РегистрСведений.СообщенияВТехническуюПоддержку КАК СообщенияВТехническуюПоддержку
	|ГДЕ
	|	СообщенияВТехническуюПоддержку.НомерРелиза = &НомерРелиза
	|	И СообщенияВТехническуюПоддержку.Отправитель = &Отправитель";
	Запрос.УстановитьПараметр("Отправитель",Пользователь);
	Запрос.УстановитьПараметр("НомерРелиза",ВерсияКонфигунации);

	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

&НаСервере
Функция ПолучитьСписокРелизов(МассивСообщений = Неопределено) Экспорт
	//Заполним список релизов
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СообщенияВТехническуюПоддержку.НомерРелиза,
	|	МАКСИМУМ(СообщенияВТехническуюПоддержку.ДатаВыполнения) КАК ДатаВыполнения
	|ИЗ
	|	РегистрСведений.СообщенияВТехническуюПоддержку КАК СообщенияВТехническуюПоддержку
	|ГДЕ
	|	НЕ СообщенияВТехническуюПоддержку.НомерРелиза = """"
	|&ОтборСообщений
	|
	|СГРУППИРОВАТЬ ПО
	|	СообщенияВТехническуюПоддержку.НомерРелиза
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыполнения УБЫВ";
	
	Запрос.УстановитьПараметр("МассивСообщений",	МассивСообщений);

	Если МассивСообщений = Неопределено ИЛИ МассивСообщений.Количество() = 0 Тогда
		
		ОтборСообщений = 
		"";
	Иначе
		ОтборСообщений = 

		"	И СообщенияВТехническуюПоддержку.Идентификатор В(&МассивСообщений)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"&ОтборСообщений",ОтборСообщений);

	ТаблицаРелизов = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТаблицаРелизов;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПунктовОбъектаНаСервере(ПолноеИмяОбъекта = "") Экспорт

	Возврат РегистрыСведений.СообщенияВТехническуюПоддержку.ПолучитьСписокПунктовОбъектаНаСервере(ПолноеИмяОбъекта);
	
КонецФункции

&НаСервере
Функция ПолучитьДатуРелиза(Релиз) Экспорт
	ТаблицаРелизов = ПолучитьСписокРелизов();
	НайденнаяСтрока = ТаблицаРелизов.Найти(Релиз);
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Дата(1,1,1);
	Иначе
		Возврат НайденнаяСтрока.ДатаВыполнения;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПечати(Пользователь, ВерсияКонфигурации, МассивСообщений = Неопределено) Экспорт
	Запрос = Новый Запрос;
	ТекстЗапроса =
	 "ВЫБРАТЬ
	 |	СообщенияВТехническуюПоддержку.Отправитель,
	 |	СообщенияВТехническуюПоддержку.ОписаниеИзменений,
	 |	СообщенияВТехническуюПоддержку.КодРазработчика,
	 |	СообщенияВТехническуюПоддержку.НомерРелиза,
	 |	СообщенияВТехническуюПоддержку.ДатаОтправки,
	 |	СообщенияВТехническуюПоддержку.ДатаВыполнения,
	 |	СообщенияВТехническуюПоддержку.Текст,
	 |	СообщенияВТехническуюПоддержку.ЗаданиеНаРазработку,
	 |	СообщенияВТехническуюПоддержку.Тема,
	 |	ВЫБОР
	 |		КОГДА СообщенияВТехническуюПоддержку.Отправитель = &Пользователь
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК СобственныйПункт
	 |ИЗ
	 |	РегистрСведений.СообщенияВТехническуюПоддержку КАК СообщенияВТехническуюПоддержку
	 |ГДЕ
	 |	СообщенияВТехническуюПоддержку.НомерРелиза = &НомерРелиза
	 | &УсловияЗапроса
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	СобственныйПункт УБЫВ,
	 |	СообщенияВТехническуюПоддержку.ДатаОтправки УБЫВ";
	Запрос.УстановитьПараметр("Пользователь",		Пользователь);
	Запрос.УстановитьПараметр("НомерРелиза",		ВерсияКонфигурации);
	Запрос.УстановитьПараметр("МассивСообщений", 	МассивСообщений);

	Если МассивСообщений = Неопределено ИЛИ МассивСообщений.Количество() = 0 Тогда
		УсловияЗапроса = 
		"";
	Иначе
		УсловияЗапроса = 

		"И СообщенияВТехническуюПоддержку.Идентификатор В(&МассивСообщений)";
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"&УсловияЗапроса",УсловияЗапроса);

 	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаЗапроса;	
	
КонецФункции

&НаСервере
Функция ОписанияИзмененийЗагружены() Экспорт
	
	ПользовательОпределен = ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь);

	//Проверяем, загружены ли описания к новому релизу
	РегистрСообщенияВТехПоддержку = Метаданные.РегистрыСведений.СообщенияВТехническуюПоддержку;
	ЕстьПравоЧтенияРегистраСообщений = ПравоДоступа("Чтение",РегистрСообщенияВТехПоддержку);
	
	Если ПользовательОпределен И ЕстьПравоЧтенияРегистраСообщений Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НомерРелиза",Метаданные.Версия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияВТехническуюПоддержку.Идентификатор
		|ИЗ
		|	РегистрСведений.СообщенияВТехническуюПоддержку КАК СообщенияВТехническуюПоддержку
		|ГДЕ
		|	СообщенияВТехническуюПоддержку.НомерРелиза = &НомерРелиза";
		ОписанияЗагружены = НЕ Запрос.Выполнить().Пустой();
		
		Возврат ОписанияЗагружены;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ВыводитьОписанияИзменений() Экспорт
	ПользовательОпределен = ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь);

	//НастройкаНеПоказыватьОписания = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НеВыводитьИнформациюПриСменеРелиза");
	НастройкаНеПоказыватьОписания = Ложь;
	Если НастройкаНеПоказыватьОписания Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ОписанияИзмененийЗагружены() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//Проверяем, прочитал ли пользователь описания
	РегистрСостоянияПросмотра = Метаданные.РегистрыСведений.СостоянияПросмотраОписаний;
	ЕстьПравоРедактированияРегистраСостояний = ПравоДоступа("Редактирование",РегистрСостоянияПросмотра); 
		
	Если ПользовательОпределен И ЕстьПравоРедактированияРегистраСостояний Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
		Запрос.УстановитьПараметр("ВерсияКонфигурации",Метаданные.Версия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияПросмотраОписаний.Просмотрено
		|ИЗ
		|	РегистрСведений.СостоянияПросмотраОписаний КАК СостоянияПросмотраОписаний
		|ГДЕ
		|	СостоянияПросмотраОписаний.ВерсияКонфигурации = &ВерсияКонфигурации
		|	И СостоянияПросмотраОписаний.Пользователь = &Пользователь
		|	И СостоянияПросмотраОписаний.Просмотрено";
		
		ИзмененияНеПрочитаны = Запрос.Выполнить().Пустой();
        Возврат ИзмененияНеПрочитаны;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// 21.10.2015, Белопухов А.Н., п.3388, КОНЕЦ
